src/test/resources/walletpayment/createWebWallet/createWebWalletRequestFull.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:createWebWalletRequest xmlns="http://obj.ws.payline.experian.com" xmlns:ns2="http://impl.ws.payline.experian.com">
            <ns2:version>99</ns2:version>
            <ns2:contractNumber>contractNumber</ns2:contractNumber>
            <ns2:selectedContractList>
                <selectedContract>CB wallet</selectedContract>
                <selectedContract>APPLE_PAY wallet</selectedContract>
            </ns2:selectedContractList>
            <ns2:updatePersonalDetails>updatePersonalDetails 789</ns2:updatePersonalDetails>
            <ns2:buyer>
                <title xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <lastName>lastnamexxx</lastName>
                <firstName>firstnameyyy</firstName>
                <email>toto@nowhere.fr</email>
                <shippingAdress>
                    <title>Maitre de lunivers</title>
                    <name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <firstName>First yeah shipping</firstName>
                    <lastName>Last oups shipping</lastName>
                    <street1>123 rue de nowhere + suffix</street1>
                    <street2>Street 2 + suffix</street2>
                    <streetNumber xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <cityName>Aix</cityName>
                    <zipCode>11000 + suffix</zipCode>
                    <country>FR</country>
                    <phone>000000000 shipping</phone>
                    <state xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <county xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <phoneType>Nokia3310 shipping</phoneType>
                    <addressCreateDate>00/00/0000</addressCreateDate>
                    <email>toto@fait.dubateau + suffix</email>
                </shippingAdress>
                <billingAddress>
                    <title>Maitre de lunivers</title>
                    <name xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <firstName>First yeah billing</firstName>
                    <lastName>Last oups billing</lastName>
                    <street1>123 rue de nowhere + suffix</street1>
                    <street2>Street 2 + suffix</street2>
                    <streetNumber xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <cityName>Aix</cityName>
                    <zipCode>11000 + suffix</zipCode>
                    <country>FR</country>
                    <phone>000000000 billing</phone>
                    <state xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <county xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                    <phoneType>Nokia3310 billing</phoneType>
                    <addressCreateDate>00/00/0000</addressCreateDate>
                    <email>toto@fait.dubateau + suffix</email>
                </billingAddress>
                <accountCreateDate>22/22/2222</accountCreateDate>
                <accountAverageAmount>1</accountAverageAmount>
                <accountOrderCount>9</accountOrderCount>
                <walletId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <walletDisplayed xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <walletSecured xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <walletCardInd xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <ip xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <mobilePhone xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <customerId>yoo</customerId>
                <legalStatus>Pacs</legalStatus>
                <legalDocumentType>Papier</legalDocumentType>
                <legalDocument>le papier</legalDocument>
                <birthDate>01/01/1900</birthDate>
                <fingerprintID>aaa-aaa-aaa</fingerprintID>
                <deviceFingerprint>print</deviceFingerprint>
                <isBot>bot false</isBot>
                <isIncognito>incognito false</isIncognito>
                <isBehindProxy>proxy false</isBehindProxy>
                <isFromTor>thor false</isFromTor>
                <isEmulator>emul false</isEmulator>
                <isRooted>root false</isRooted>
                <hasTimezoneMismatch>jesaispas</hasTimezoneMismatch>
                <loyaltyMemberType xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                <buyerExtended>BuyerExt</buyerExtended>
                <merchantAuthentication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            </ns2:buyer>
            <ns2:owner>
                <lastName>Owner LastName</lastName>
                <firstName>Owner firstname</firstName>
                <billingAddress>
                    <street>123 rue de nowhere</street>
                    <cityName>Aix</cityName>
                    <zipCode>11000</zipCode>
                    <country>FR</country>
                    <phone>0600000000</phone>
                </billingAddress>
                <issueCardDate>15/12/2020 10:00</issueCardDate>
            </ns2:owner>
            <ns2:languageCode>FR_fr</ns2:languageCode>
            <ns2:customPaymentPageCode>PloufXX</ns2:customPaymentPageCode>
            <ns2:securityMode>XX</ns2:securityMode>
            <ns2:returnURL>http://return.url</ns2:returnURL>
            <ns2:cancelURL>http://cancel.url</ns2:cancelURL>
            <ns2:notificationURL>http://notif.url</ns2:notificationURL>
            <ns2:privateDataList>
                <privateData>
                    <key>pvDataKey</key>
                    <value>pvDataValue</value>
                </privateData>
            </ns2:privateDataList>
            <ns2:customPaymentTemplateURL>PloufXXUrl</ns2:customPaymentTemplateURL>
            <ns2:contractNumberWalletList>
                <contractNumberWallet>CB create</contractNumberWallet>
            </ns2:contractNumberWalletList>
        </ns2:createWebWalletRequest>
    </S:Body>
</S:Envelope>